# Getting started with pandas

In [6]:
from pandas import Series, DataFrame
import pandas as pd

In [7]:
from __future__ import division
from numpy.random import randn
import numpy as np
import os
import matplotlib.pyplot as plt
np.random.seed(12345)
plt.rc('figure', figsize=(10, 6))
from pandas import Series, DataFrame
import pandas as pd
np.set_printoptions(precision=4)

In [8]:
%pwd

u'Z:\\pydata-book'

## Introduction to pandas data structures

### Series

In [9]:
obj = Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [10]:
print obj.values
print obj.index

[ 4  7 -5  3]
RangeIndex(start=0, stop=4, step=1)

In [11]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [12]:
obj2.index

Index([u'd', u'b', u'a', u'c'], dtype='object')

In [13]:
obj2['a']

-5

In [14]:
obj2['d'] = 6
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [15]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [16]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [17]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [18]:
'b' in obj2

True

In [19]:
'e' in obj2

False

In [20]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [21]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [22]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [23]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [24]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [25]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [26]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [27]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [28]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [29]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

In [30]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)

In [31]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [32]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [33]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                   index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [34]:
frame2.columns

Index([u'year', u'state', u'pop', u'debt'], dtype='object')

In [35]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [36]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [37]:
frame2.ix['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [38]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [39]:
frame2['debt'] = np.arange(5.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [40]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [41]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt eastern
one    2000    Ohio  1.5   NaN    True
two    2001    Ohio  1.7  -1.2    True
three  2002    Ohio  3.6   NaN    True
four   2001  Nevada  2.4  -1.5   False
five   2002  Nevada  2.9  -1.7   False

In [42]:
del frame2['eastern']
frame2.columns

Index([u'year', u'state', u'pop', u'debt'], dtype='object')

In [43]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [44]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [45]:
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [46]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [47]:
DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [48]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [49]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [50]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [51]:
frame2.values

array([[2000L, 'Ohio', 1.5, nan],
       [2001L, 'Ohio', 1.7, -1.2],
       [2002L, 'Ohio', 3.6, nan],
       [2001L, 'Nevada', 2.4, -1.5],
       [2002L, 'Nevada', 2.9, -1.7]], dtype=object)

### Index objects

In [52]:
obj = Series(range(3), index=['a', 'b', 'c'])
index = obj.index
index

Index([u'a', u'b', u'c'], dtype='object')

In [53]:
index[1:]

Index([u'b', u'c'], dtype='object')

In [54]:
index[1] = 'd'

TypeError: Index does not support mutable operations

In [55]:
index = pd.Index(np.arange(3))
obj2 = Series([1.5, -2.5, 0], index=index)
obj2.index is index

True

In [56]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [57]:
'Ohio' in frame3.columns

True

In [58]:
2003 in frame3.index

False

## Essential functionality

### Reindexing

In [59]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [60]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [61]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [62]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [63]:
frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],
                  columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [64]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [65]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [66]:
frame.reindex(index=['a', 'b', 'c', 'd'], method='ffill',
              columns=states)

   Texas  Utah  California
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [67]:
frame.ix[['a', 'b', 'c', 'd'], states]

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

### Dropping entries from an axis

In [68]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [69]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [70]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])

In [71]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [72]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [73]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [74]:
data.drop(['two', 'four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

### Indexing, selection, and filtering

In [75]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj['b']

1.0

In [76]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [77]:
obj[1]

1.0

In [78]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [79]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [80]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [81]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [82]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [83]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [84]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [85]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [86]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [87]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [88]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [89]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [90]:
data[data < 5] = 0

In [91]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [92]:
data.ix['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [93]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [94]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [95]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [96]:
data.ix[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [97]:
data.ix[data.three > 5, :3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### Arithmetic and data alignment

In [98]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [99]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [100]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [101]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [102]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                index=['Ohio', 'Texas', 'Colorado'])
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [103]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [104]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

#### Arithmetic methods with fill values

In [105]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [106]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [107]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [108]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [109]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [110]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [111]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

#### Operations between DataFrame and Series

In [112]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [113]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [114]:
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [115]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.ix[0]
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [116]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [117]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [118]:
series2 = Series(range(3), index=['b', 'e', 'f'])
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [119]:
series2

b    0
e    1
f    2
dtype: int64

In [120]:
series3 = frame['d']
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [121]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [122]:
frame.sub(series3, axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### Function application and mapping

In [123]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [124]:
frame

               b         d         e
Utah   -0.204708  0.478943 -0.519439
Ohio   -0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregon  1.246435  1.007189 -1.296221

In [125]:
np.abs(frame)

               b         d         e
Utah    0.204708  0.478943  0.519439
Ohio    0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregon  1.246435  1.007189  1.296221

In [126]:
f = lambda x: x.max() - x.min()

In [127]:
frame.apply(f)

b    1.802165
d    1.684034
e    2.689627
dtype: float64

In [128]:
frame.apply(f, axis=1)

Utah      0.998382
Ohio      2.521511
Texas     0.676115
Oregon    2.542656
dtype: float64

In [129]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

            b         d         e
min -0.555730  0.281746 -1.296221
max  1.246435  1.965781  1.393406

In [130]:
format = lambda x: '%.2f' % x
frame.applymap(format)

            b     d      e
Utah    -0.20  0.48  -0.52
Ohio    -0.56  1.97   1.39
Texas    0.09  0.28   0.77
Oregon   1.25  1.01  -1.30

In [131]:
frame['e'].map(format)

Utah      -0.52
Ohio       1.39
Texas      0.77
Oregon    -1.30
Name: e, dtype: object

In [132]:
frame

               b         d         e
Utah   -0.204708  0.478943 -0.519439
Ohio   -0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregon  1.246435  1.007189 -1.296221

### Sorting and ranking

In [133]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [134]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [135]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
                  columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [136]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [137]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [138]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [139]:
obj = Series([4, 7, -3, 2])
obj.order()

C:\Anaconda2\lib\site-packages\ipykernel\__main__.py:2: FutureWarning: order is deprecated, use sort_values(...)
  from ipykernel import kernelapp as app

2   -3
3    2
0    4
1    7
dtype: int64

In [140]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])
obj.order()

C:\Anaconda2\lib\site-packages\ipykernel\__main__.py:2: FutureWarning: order is deprecated, use sort_values(...)
  from ipykernel import kernelapp as app

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [141]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [142]:
frame.sort_index(by='b')

C:\Anaconda2\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  if __name__ == '__main__':

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [143]:
frame.sort_index(by=['a', 'b'])

C:\Anaconda2\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  if __name__ == '__main__':

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [144]:
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [145]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [146]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [147]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                   'c': [-2, 5, 8, -2.5]})
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [148]:
frame.rank(axis=1)

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

### Axis indexes with duplicate values

In [149]:
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [150]:
obj.index.is_unique

False

In [151]:
obj['a']

a    0
a    1
dtype: int64

In [152]:
obj['c']

4

In [153]:
df = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a  0.274992  0.228913  1.352917
a  0.886429 -2.001637 -0.371843
b  1.669025 -0.438570 -0.539741
b  0.476985  3.248944 -1.021228

In [154]:
df.ix['b']

          0         1         2
b  1.669025 -0.438570 -0.539741
b  0.476985  3.248944 -1.021228

## Summarizing and computing descriptive statistics

In [155]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
                [np.nan, np.nan], [0.75, -1.3]],
               index=['a', 'b', 'c', 'd'],
               columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [156]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [157]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [158]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [159]:
df.idxmax()

one    b
two    d
dtype: object

In [160]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [161]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [162]:
obj = Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### Correlation and covariance

In [163]:
import pandas.io.data as web

all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker)

price = DataFrame({tic: data['Adj Close']
                   for tic, data in all_data.iteritems()})
volume = DataFrame({tic: data['Volume']
                    for tic, data in all_data.iteritems()})

C:\Anaconda2\lib\site-packages\pandas\io\data.py:35: FutureWarning:
The pandas.io.data module is moved to a separate package (pandas-datareader) and will be removed from pandas in a future version.
After installing the pandas-datareader package (https://github.com/pydata/pandas-datareader), you can change the import ``from pandas.io import data, wb`` to ``from pandas_datareader import data, wb``.
  FutureWarning)

In [164]:
price.head()

                 AAPL        GOOG         IBM       MSFT
Date
2010-01-04  28.141855  313.062468  114.283108  26.045432
2010-01-05  28.190509  311.683844  112.902572  26.053846
2010-01-06  27.742101  303.826685  112.169153  25.893956
2010-01-07  27.690818  296.753749  111.780878  25.624666
2010-01-08  27.874915  300.709808  112.902572  25.801387

In [165]:
price.tail()

                  AAPL        GOOG         IBM       MSFT
Date
2016-05-23   96.430000  704.239990  146.770004  50.029999
2016-05-24   97.900002  720.090027  148.309998  51.590000
2016-05-25   99.620003  725.270020  151.690002  52.119999
2016-05-26  100.410004  724.119995  152.440002  51.889999
2016-05-27  100.349998  732.659973  152.839996  52.320000

In [166]:
volume.head(3)

                 AAPL     GOOG      IBM      MSFT
Date
2010-01-04  123432400  3927000  6155300  38409100
2010-01-05  150476200  6031900  6841400  49749600
2010-01-06  138040000  7987100  5605300  58182400

In [167]:
volume.tail(3)

                AAPL     GOOG      IBM      MSFT
Date
2016-05-25  38168800  1629200  4355300  24040200
2016-05-26  56093400  1542900  3023100  24182900
2016-05-27  36229500  1974000  2422100  17653700

In [168]:
returns = price.pct_change()
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-05-23  0.012707 -0.007749 -0.003260 -0.011655
2016-05-24  0.015244  0.022507  0.010493  0.031181
2016-05-25  0.017569  0.007194  0.022790  0.010273
2016-05-26  0.007930 -0.001586  0.004944 -0.004413
2016-05-27 -0.000598  0.011794  0.002624  0.008287

In [169]:
returns.MSFT.corr(returns.IBM)

0.49568635476940565

In [170]:
returns.MSFT.cov(returns.IBM)

8.9693577734447369e-05

In [171]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.406640  0.387747  0.393592
GOOG  0.406640  1.000000  0.402400  0.464852
IBM   0.387747  0.402400  1.000000  0.495686
MSFT  0.393592  0.464852  0.495686  1.000000

In [172]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000285  0.000111  0.000080  0.000098
GOOG  0.000111  0.000261  0.000079  0.000111
IBM   0.000080  0.000079  0.000149  0.000090
MSFT  0.000098  0.000111  0.000090  0.000220

In [173]:
returns.corrwith(returns.IBM)

AAPL    0.387747
GOOG    0.402400
IBM     1.000000
MSFT    0.495686
dtype: float64

In [174]:
returns.corrwith(volume)

AAPL   -0.080745
GOOG   -0.005495
IBM    -0.204476
MSFT   -0.093580
dtype: float64

### Unique values, value counts, and membership

In [175]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [176]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [177]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [178]:
pd.value_counts(obj.values, sort=False)

a    3
c    3
b    2
d    1
dtype: int64

In [179]:
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [180]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [181]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],
                  'Qu2': [2, 3, 1, 2, 3],
                  'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [182]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

## Handling missing data

In [183]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [184]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [185]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering out missing data

In [186]:
from numpy import nan as NA
data = Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [187]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [188]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [189]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],
                  [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [190]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [191]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [192]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [193]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [194]:
df = DataFrame(np.random.randn(7, 3))
df.ix[:4, 1] = NA; df.ix[:2, 2] = NA
df

          0         1         2
0 -0.577087       NaN       NaN
1  0.523772       NaN       NaN
2 -0.713544       NaN       NaN
3 -1.860761       NaN  0.560145
4 -1.265934       NaN -1.063512
5  0.332883 -2.359419 -0.199543
6 -1.541996 -0.970736 -1.307030

In [195]:
df.dropna(thresh=3)

          0         1         2
5  0.332883 -2.359419 -0.199543
6 -1.541996 -0.970736 -1.307030

### Filling in missing data

In [196]:
df.fillna(0)

          0         1         2
0 -0.577087  0.000000  0.000000
1  0.523772  0.000000  0.000000
2 -0.713544  0.000000  0.000000
3 -1.860761  0.000000  0.560145
4 -1.265934  0.000000 -1.063512
5  0.332883 -2.359419 -0.199543
6 -1.541996 -0.970736 -1.307030

In [197]:
df

          0         1         2
0 -0.577087       NaN       NaN
1  0.523772       NaN       NaN
2 -0.713544       NaN       NaN
3 -1.860761       NaN  0.560145
4 -1.265934       NaN -1.063512
5  0.332883 -2.359419 -0.199543
6 -1.541996 -0.970736 -1.307030

In [198]:
df.fillna({1: 0.5, 3: -1})

          0         1         2
0 -0.577087  0.500000       NaN
1  0.523772  0.500000       NaN
2 -0.713544  0.500000       NaN
3 -1.860761  0.500000  0.560145
4 -1.265934  0.500000 -1.063512
5  0.332883 -2.359419 -0.199543
6 -1.541996 -0.970736 -1.307030

In [199]:
# always returns a reference to the filled object
_ = df.fillna(0, inplace=True)
df

          0         1         2
0 -0.577087  0.000000  0.000000
1  0.523772  0.000000  0.000000
2 -0.713544  0.000000  0.000000
3 -1.860761  0.000000  0.560145
4 -1.265934  0.000000 -1.063512
5  0.332883 -2.359419 -0.199543
6 -1.541996 -0.970736 -1.307030

In [200]:
df = DataFrame(np.random.randn(6, 3))
df.ix[2:, 1] = NA; df.ix[4:, 2] = NA
df

          0         1         2
0  0.286350  0.377984 -0.753887
1  0.331286  1.349742  0.069877
2  0.246674       NaN  1.004812
3  1.327195       NaN -1.549106
4  0.022185       NaN       NaN
5  0.862580       NaN       NaN

In [201]:
df.fillna(method='ffill')

          0         1         2
0  0.286350  0.377984 -0.753887
1  0.331286  1.349742  0.069877
2  0.246674  1.349742  1.004812
3  1.327195  1.349742 -1.549106
4  0.022185  1.349742 -1.549106
5  0.862580  1.349742 -1.549106

In [202]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.286350  0.377984 -0.753887
1  0.331286  1.349742  0.069877
2  0.246674  1.349742  1.004812
3  1.327195  1.349742 -1.549106
4  0.022185       NaN -1.549106
5  0.862580       NaN -1.549106

In [203]:
data = Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Hierarchical indexing

In [204]:
data = Series(np.random.randn(10),
              index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                     [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
data

a  1    0.670216
   2    0.852965
   3   -0.955869
b  1   -0.023493
   2   -2.304234
   3   -0.652469
c  1   -1.218302
   2   -1.332610
d  2    1.074623
   3    0.723642
dtype: float64

In [205]:
data.index

MultiIndex(levels=[[u'a', u'b', u'c', u'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [206]:
data['b']

1   -0.023493
2   -2.304234
3   -0.652469
dtype: float64

In [207]:
data['b':'c']

b  1   -0.023493
   2   -2.304234
   3   -0.652469
c  1   -1.218302
   2   -1.332610
dtype: float64

In [208]:
data.ix[['b', 'd']]

b  1   -0.023493
   2   -2.304234
   3   -0.652469
d  2    1.074623
   3    0.723642
dtype: float64

In [209]:
data[:, 2]

a    0.852965
b   -2.304234
c   -1.332610
d    1.074623
dtype: float64

In [210]:
data.unstack()

          1         2         3
a  0.670216  0.852965 -0.955869
b -0.023493 -2.304234 -0.652469
c -1.218302 -1.332610       NaN
d       NaN  1.074623  0.723642

In [211]:
data.unstack().stack()

a  1    0.670216
   2    0.852965
   3   -0.955869
b  1   -0.023493
   2   -2.304234
   3   -0.652469
c  1   -1.218302
   2   -1.332610
d  2    1.074623
   3    0.723642
dtype: float64

In [212]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'],
                           ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [213]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [214]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [216]:
pd.MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']],
                       names=['state', 'color'])

MultiIndex(levels=[[u'Colorado', u'Ohio'], [u'Green', u'Red']],
           labels=[[1, 1, 0], [0, 1, 0]],
           names=[u'state', u'color'])

### Reordering and sorting levels

In [217]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [218]:
frame.sortlevel(1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [219]:
frame.swaplevel(0, 1).sortlevel(0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

### Summary statistics by level

In [220]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [221]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### Using a DataFrame's columns

In [222]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),
                   'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                   'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [223]:
frame2 = frame.set_index(['c', 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [224]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [225]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

## Other pandas topics

### Integer indexing

In [226]:
ser = Series(np.arange(3.))
ser.iloc[-1]

2.0

In [227]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [228]:
ser2 = Series(np.arange(3.), index=['a', 'b', 'c'])
ser2[-1]

2.0

In [229]:
ser.ix[:1]

0    0.0
1    1.0
dtype: float64

In [230]:
ser3 = Series(range(3), index=[-5, 1, 3])
ser3.iloc[2]

2

In [231]:
frame = DataFrame(np.arange(6).reshape((3, 2)), index=[2, 0, 1])
frame.iloc[0]

0    0
1    1
Name: 2, dtype: int32

### Panel data

In [232]:
import pandas.io.data as web

pdata = pd.Panel(dict((stk, web.get_data_yahoo(stk))
                       for stk in ['AAPL', 'GOOG', 'MSFT', 'DELL']))

In [233]:
pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 1632 (major_axis) x 6 (minor_axis)
Items axis: AAPL to MSFT
Major_axis axis: 2010-01-04 00:00:00 to 2016-05-27 00:00:00
Minor_axis axis: Open to Adj Close

In [236]:
pdata = pdata.swapaxes('items', 'minor')
pdata['Adj Close']

                  AAPL      DELL        GOOG       MSFT
Date
2010-01-04   28.141855  14.06528  313.062468  26.045432
2010-01-05   28.190509  14.38450  311.683844  26.053846
2010-01-06   27.742101  14.10397  303.826685  25.893956
2010-01-07   27.690818  14.23940  296.753749  25.624666
2010-01-08   27.874915  14.36516  300.709808  25.801387
2010-01-11   27.629014  14.37483  300.255255  25.473190
2010-01-12   27.314734  14.56830  294.945572  25.304883
2010-01-13   27.700023  14.57797  293.252243  25.540513
2010-01-14   27.539595  14.22005  294.630868  26.053846
2010-01-15   27.079353  13.92985  289.710772  25.969694
2010-01-19   28.277297  14.32646  293.516976  26.171662
2010-01-20   27.842040  14.03626  289.915587  25.742480
2010-01-21   27.360757  13.92017  291.199286  25.254391
2010-01-22   26.003700  13.18982  274.730736  24.370781
2010-01-25   26.703269  13.43650  269.730740  24.673733
2010-01-26   27.080668  13.13662  270.939526  24.825210
2010-01-27   27.335774  13.08825  270.779695  24.968270
2010-01-28   26.206206  12.84641  266.878565  24.539088
2010-01-29   25.255478  12.47882  264.705742  23.714387
2010-02-01   25.606576  12.78837  266.244198  23.907939
2010-02-02   25.755169  12.86576  265.295156  23.950015
2010-02-03   26.198316  12.92380  270.140309  24.093076
2010-02-04   25.254163  12.58523  263.127321  23.428266
2010-02-05   25.702570  12.80772  265.380075  23.579742
2010-02-08   25.526363  12.95282  266.468996  23.327281
2010-02-09   25.798564  13.10760  267.952522  23.571326
2010-02-10   25.657862  13.30107  266.958496  23.554495
2010-02-11   26.124677  13.49454  267.932539  23.663895
2010-02-12   26.349539  13.38813  266.294170  23.504004
2010-02-16   26.746662  13.67834  270.380071  23.969011
...                ...       ...         ...        ...
2016-04-18  106.829577       NaN  766.609985  56.067840
2016-04-19  106.263027       NaN  753.929993  55.998326
2016-04-20  106.481689       NaN  752.669983  55.203884
2016-04-21  105.328713       NaN  759.140015  55.392563
2016-04-22  105.040467       NaN  718.770020  51.420346
2016-04-25  104.444100       NaN  723.150024  51.748056
2016-04-26  103.718514       NaN  708.140015  51.082707
2016-04-27   97.228032       NaN  705.840027  50.586180
2016-04-28   94.256129       NaN  691.020020  49.553407
2016-04-29   93.172721       NaN  693.010010  49.523612
2016-05-02   93.073328       NaN  698.210022  50.258474
2016-05-03   94.604009       NaN  692.359985  49.434237
2016-05-04   93.620002       NaN  695.700012  49.523612
2016-05-05   93.239998       NaN  701.429993  49.593126
2016-05-06   92.720001       NaN  711.119995  50.040001
2016-05-09   92.790001       NaN  712.900024  49.722224
2016-05-10   93.419998       NaN  723.179993  50.665626
2016-05-11   92.510002       NaN  715.289978  50.695417
2016-05-12   90.339996       NaN  713.309998  51.152221
2016-05-13   90.519997       NaN  710.830017  50.725211
2016-05-16   93.879997       NaN  716.489990  51.470002
2016-05-17   93.489998       NaN  706.229980  50.509998
2016-05-18   94.559998       NaN  706.630005  50.810001
2016-05-19   94.199997       NaN  700.320007  50.320000
2016-05-20   95.220001       NaN  709.739990  50.619999
2016-05-23   96.430000       NaN  704.239990  50.029999
2016-05-24   97.900002       NaN  720.090027  51.590000
2016-05-25   99.620003       NaN  725.270020  52.119999
2016-05-26  100.410004       NaN  724.119995  51.889999
2016-05-27  100.349998       NaN  732.659973  52.320000

[1632 rows x 4 columns]

In [237]:
pdata.ix[:, '6/1/2012', :]

            Open        High         Low       Close       Volume   Adj Close
AAPL  569.159996  572.650009  560.520012  560.989983  130246900.0   73.768977
DELL   12.150000   12.300000   12.045000   12.070000   19397600.0   11.675920
GOOG  571.790972  572.650996  568.350996  570.981000    6138700.0  285.205295
MSFT   28.760000   28.959999   28.440001   28.450001   56634300.0   25.420428

In [238]:
pdata.ix['Adj Close', '5/22/2012':, :]

                  AAPL      DELL        GOOG       MSFT
Date
2012-05-22   73.240361  14.58765  300.100412  26.590928
2012-05-23   75.027411  12.08221  304.426106  26.010146
2012-05-24   74.338367  12.04351  301.528978  25.974404
2012-05-25   73.939925  12.05319  295.470050  25.965469
2012-05-28         NaN  12.05319         NaN        NaN
2012-05-29   75.252272  12.24666  296.873645  26.412225
2012-05-30   76.159610  12.14992  293.821674  26.215653
2012-05-31   75.970256  11.92743  290.140354  26.081627
2012-06-01   73.768977  11.67592  285.205295  25.420428
2012-06-04   74.202920  11.60821  289.006480  25.509777
2012-06-05   74.010939  11.76298  284.920579  25.474038
2012-06-06   75.145765  11.81619  289.995487  26.224588
2012-06-07   75.179952  11.73396  288.826666  26.117366
2012-06-08   76.310831  11.72429  289.935570  26.492641
2012-06-11   75.107625  11.47278  283.966519  25.822507
2012-06-12   75.763802  11.57919  282.268201  26.170978
2012-06-13   75.237812  11.87423  280.265216  26.028015
2012-06-14   75.154965  11.93711  279.246220  26.215653
2012-06-15   75.496860  11.89841  281.973510  26.823242
2012-06-18   77.028808  12.01449  285.140358  26.662409
2012-06-19   77.243156  11.78233  290.475012  27.430830
2012-06-20   77.023548  11.89841  288.467038  27.636338
2012-06-21   75.962363  11.60821  282.323161  26.930462
2012-06-22   76.544899  11.80168  285.455033  27.430830
2012-06-25   75.055031  11.55500  280.070407  26.689215
2012-06-26   75.220719  11.53565  282.058429  26.823242
2012-06-27   75.545514  11.92743  284.366112  26.957268
2012-06-28   74.828850  11.55984  281.873596  26.724955
2012-06-29   76.794747  12.10155  289.745749  27.332543
2012-07-02   77.915106  11.98064  289.945546  27.305737
...                ...       ...         ...        ...
2016-04-18  106.829577       NaN  766.609985  56.067840
2016-04-19  106.263027       NaN  753.929993  55.998326
2016-04-20  106.481689       NaN  752.669983  55.203884
2016-04-21  105.328713       NaN  759.140015  55.392563
2016-04-22  105.040467       NaN  718.770020  51.420346
2016-04-25  104.444100       NaN  723.150024  51.748056
2016-04-26  103.718514       NaN  708.140015  51.082707
2016-04-27   97.228032       NaN  705.840027  50.586180
2016-04-28   94.256129       NaN  691.020020  49.553407
2016-04-29   93.172721       NaN  693.010010  49.523612
2016-05-02   93.073328       NaN  698.210022  50.258474
2016-05-03   94.604009       NaN  692.359985  49.434237
2016-05-04   93.620002       NaN  695.700012  49.523612
2016-05-05   93.239998       NaN  701.429993  49.593126
2016-05-06   92.720001       NaN  711.119995  50.040001
2016-05-09   92.790001       NaN  712.900024  49.722224
2016-05-10   93.419998       NaN  723.179993  50.665626
2016-05-11   92.510002       NaN  715.289978  50.695417
2016-05-12   90.339996       NaN  713.309998  51.152221
2016-05-13   90.519997       NaN  710.830017  50.725211
2016-05-16   93.879997       NaN  716.489990  51.470002
2016-05-17   93.489998       NaN  706.229980  50.509998
2016-05-18   94.559998       NaN  706.630005  50.810001
2016-05-19   94.199997       NaN  700.320007  50.320000
2016-05-20   95.220001       NaN  709.739990  50.619999
2016-05-23   96.430000       NaN  704.239990  50.029999
2016-05-24   97.900002       NaN  720.090027  51.590000
2016-05-25   99.620003       NaN  725.270020  52.119999
2016-05-26  100.410004       NaN  724.119995  51.889999
2016-05-27  100.349998       NaN  732.659973  52.320000

[1025 rows x 4 columns]

In [239]:
stacked = pdata.ix[:, '5/30/2012':, :].to_frame()
stacked

                        Open        High         Low       Close       Volume  \
Date       minor
2012-05-30 AAPL   569.199997  579.989990  566.559990  579.169998  132357400.0
           DELL    12.590000   12.700000   12.460000   12.560000   19787800.0
           GOOG   588.161028  591.901014  583.530999  588.230992    3827600.0
           MSFT    29.350000   29.480000   29.120001   29.340000   41585500.0
2012-05-31 AAPL   580.740021  581.499985  571.460022  577.730019  122918600.0
           DELL    12.530000   12.540000   12.330000   12.330000   19955600.0
           GOOG   588.720982  590.001032  579.001013  580.860990    5958800.0
           MSFT    29.299999   29.420000   28.940001   29.190001   39134000.0
2012-06-01 AAPL   569.159996  572.650009  560.520012  560.989983  130246900.0
           DELL    12.150000   12.300000   12.045000   12.070000   19397600.0
           GOOG   571.790972  572.650996  568.350996  570.981000    6138700.0
           MSFT    28.760000   28.959999   28.440001   28.450001   56634300.0
2012-06-04 AAPL   561.500008  567.499985  548.499977  564.289978  139248900.0
           DELL    12.110000   12.112500   11.800000   12.000000   17015700.0
           GOOG   570.220958  580.491016  570.011006  578.590973    4883500.0
           MSFT    28.620001   28.780001   28.320000   28.549999   47926300.0
2012-06-05 AAPL   561.269989  566.470001  558.330002  562.830025   97053600.0
           DELL    11.950000   12.240000   11.950000   12.160000   15620900.0
           GOOG   575.451008  578.131003  566.470986  570.410999    4697200.0
           MSFT    28.510000   28.750000   28.389999   28.510000   45715400.0
2012-06-06 AAPL   567.770004  573.849983  565.499992  571.460022  100363900.0
           DELL    12.210000   12.280000   12.090000   12.215000   20779900.0
           GOOG   576.480979  581.970971  573.611004  580.570966    4207200.0
           MSFT    28.879999   29.370001   28.809999   29.350000   46860500.0
2012-06-07 AAPL   577.290009  577.320023  570.500000  571.720001   94941700.0
           DELL    12.320000   12.410000   12.120000   12.130000   20074000.0
           GOOG   587.601014  587.891038  577.251006  578.230986    3530100.0
           MSFT    29.639999   29.700001   29.170000   29.230000   37792800.0
2012-06-08 AAPL   571.599998  580.580017  568.999992  580.319984   86879100.0
           DELL    12.130000   12.225000   12.020000   12.120000   18155600.0
...                      ...         ...         ...         ...          ...
2016-05-16 AAPL    92.389999   94.389999   91.650002   93.879997   61140600.0
           GOOG   709.130005  718.479980  705.650024  716.489990    1316200.0
           MSFT    50.799999   51.959999   50.750000   51.830002   20032000.0
2016-05-17 AAPL    94.550003   94.699997   93.010002   93.489998   46507400.0
           GOOG   715.989990  721.520020  704.109985  706.229980    1999500.0
           MSFT    51.720001   51.730000   50.360001   50.509998   27803500.0
2016-05-18 AAPL    94.160004   95.209999   93.889999   94.559998   41923100.0
           GOOG   703.669983  711.599976  700.630005  706.630005    1763400.0
           MSFT    50.480000   51.139999   50.299999   50.810001   24907500.0
2016-05-19 AAPL    94.639999   94.639999   93.570000   94.199997   30342700.0
           GOOG   702.359985  706.000000  696.799988  700.320007    1656300.0
           MSFT    50.470001   50.619999   49.820000   50.320000   23842400.0
2016-05-20 AAPL    94.639999   95.430000   94.519997   95.220001   31804600.0
           GOOG   701.619995  714.580017  700.520020  709.739990    1816000.0
           MSFT    50.480000   51.220001   50.400002   50.619999   23692400.0
2016-05-23 AAPL    95.870003   97.190002   95.669998   96.430000   37860500.0
           GOOG   706.530029  711.478027  704.179993  704.239990    1320900.0
           MSFT    50.599998   50.680000   49.980000   50.029999   25999700.0
2016-05-24 AAPL    97.220001   98.089996   96.839996   97.900002   35036800.0
           GOOG   706.859985  720.969971  706.859985  720.090027    1920400.0
           MSFT    50.700001   51.709999   50.400002   51.590000   34621600.0
2016-05-25 AAPL    98.669998   99.739998   98.110001   99.620003   38168800.0
           GOOG   720.760010  727.510010  719.705017  725.270020    1629200.0
           MSFT    51.919998   52.490002   51.790001   52.119999   24040200.0
2016-05-26 AAPL    99.680000  100.730003   98.639999  100.410004   56093400.0
           GOOG   722.869995  728.330017  720.280029  724.119995    1542900.0
           MSFT    51.930000   51.980000   51.360001   51.889999   24182900.0
2016-05-27 AAPL    99.440002  100.470001   99.250000  100.349998   36229500.0
           GOOG   724.010010  733.935974  724.000000  732.659973    1974000.0
           MSFT    51.919998   52.320000   51.770000   52.320000   17653700.0

                   Adj Close
Date       minor
2012-05-30 AAPL    76.159610
           DELL    12.149920
           GOOG   293.821674
           MSFT    26.215653
2012-05-31 AAPL    75.970256
           DELL    11.927430
           GOOG   290.140354
           MSFT    26.081627
2012-06-01 AAPL    73.768977
           DELL    11.675920
           GOOG   285.205295
           MSFT    25.420428
2012-06-04 AAPL    74.202920
           DELL    11.608210
           GOOG   289.006480
           MSFT    25.509777
2012-06-05 AAPL    74.010939
           DELL    11.762980
           GOOG   284.920579
           MSFT    25.474038
2012-06-06 AAPL    75.145765
           DELL    11.816190
           GOOG   289.995487
           MSFT    26.224588
2012-06-07 AAPL    75.179952
           DELL    11.733960
           GOOG   288.826666
           MSFT    26.117366
2012-06-08 AAPL    76.310831
           DELL    11.724290
...                      ...
2016-05-16 AAPL    93.879997
           GOOG   716.489990
           MSFT    51.470002
2016-05-17 AAPL    93.489998
           GOOG   706.229980
           MSFT    50.509998
2016-05-18 AAPL    94.559998
           GOOG   706.630005
           MSFT    50.810001
2016-05-19 AAPL    94.199997
           GOOG   700.320007
           MSFT    50.320000
2016-05-20 AAPL    95.220001
           GOOG   709.739990
           MSFT    50.619999
2016-05-23 AAPL    96.430000
           GOOG   704.239990
           MSFT    50.029999
2016-05-24 AAPL    97.900002
           GOOG   720.090027
           MSFT    51.590000
2016-05-25 AAPL    99.620003
           GOOG   725.270020
           MSFT    52.119999
2016-05-26 AAPL   100.410004
           GOOG   724.119995
           MSFT    51.889999
2016-05-27 AAPL   100.349998
           GOOG   732.659973
           MSFT    52.320000

[3388 rows x 6 columns]

In [240]:
stacked.to_panel()

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 1019 (major_axis) x 4 (minor_axis)
Items axis: Open to Adj Close
Major_axis axis: 2012-05-30 00:00:00 to 2016-05-27 00:00:00
Minor_axis axis: AAPL to MSFT

In [241]:
stacked

                        Open        High         Low       Close       Volume  \
Date       minor
2012-05-30 AAPL   569.199997  579.989990  566.559990  579.169998  132357400.0
           DELL    12.590000   12.700000   12.460000   12.560000   19787800.0
           GOOG   588.161028  591.901014  583.530999  588.230992    3827600.0
           MSFT    29.350000   29.480000   29.120001   29.340000   41585500.0
2012-05-31 AAPL   580.740021  581.499985  571.460022  577.730019  122918600.0
           DELL    12.530000   12.540000   12.330000   12.330000   19955600.0
           GOOG   588.720982  590.001032  579.001013  580.860990    5958800.0
           MSFT    29.299999   29.420000   28.940001   29.190001   39134000.0
2012-06-01 AAPL   569.159996  572.650009  560.520012  560.989983  130246900.0
           DELL    12.150000   12.300000   12.045000   12.070000   19397600.0
           GOOG   571.790972  572.650996  568.350996  570.981000    6138700.0
           MSFT    28.760000   28.959999   28.440001   28.450001   56634300.0
2012-06-04 AAPL   561.500008  567.499985  548.499977  564.289978  139248900.0
           DELL    12.110000   12.112500   11.800000   12.000000   17015700.0
           GOOG   570.220958  580.491016  570.011006  578.590973    4883500.0
           MSFT    28.620001   28.780001   28.320000   28.549999   47926300.0
2012-06-05 AAPL   561.269989  566.470001  558.330002  562.830025   97053600.0
           DELL    11.950000   12.240000   11.950000   12.160000   15620900.0
           GOOG   575.451008  578.131003  566.470986  570.410999    4697200.0
           MSFT    28.510000   28.750000   28.389999   28.510000   45715400.0
2012-06-06 AAPL   567.770004  573.849983  565.499992  571.460022  100363900.0
           DELL    12.210000   12.280000   12.090000   12.215000   20779900.0
           GOOG   576.480979  581.970971  573.611004  580.570966    4207200.0
           MSFT    28.879999   29.370001   28.809999   29.350000   46860500.0
2012-06-07 AAPL   577.290009  577.320023  570.500000  571.720001   94941700.0
           DELL    12.320000   12.410000   12.120000   12.130000   20074000.0
           GOOG   587.601014  587.891038  577.251006  578.230986    3530100.0
           MSFT    29.639999   29.700001   29.170000   29.230000   37792800.0
2012-06-08 AAPL   571.599998  580.580017  568.999992  580.319984   86879100.0
           DELL    12.130000   12.225000   12.020000   12.120000   18155600.0
...                      ...         ...         ...         ...          ...
2016-05-16 AAPL    92.389999   94.389999   91.650002   93.879997   61140600.0
           GOOG   709.130005  718.479980  705.650024  716.489990    1316200.0
           MSFT    50.799999   51.959999   50.750000   51.830002   20032000.0
2016-05-17 AAPL    94.550003   94.699997   93.010002   93.489998   46507400.0
           GOOG   715.989990  721.520020  704.109985  706.229980    1999500.0
           MSFT    51.720001   51.730000   50.360001   50.509998   27803500.0
2016-05-18 AAPL    94.160004   95.209999   93.889999   94.559998   41923100.0
           GOOG   703.669983  711.599976  700.630005  706.630005    1763400.0
           MSFT    50.480000   51.139999   50.299999   50.810001   24907500.0
2016-05-19 AAPL    94.639999   94.639999   93.570000   94.199997   30342700.0
           GOOG   702.359985  706.000000  696.799988  700.320007    1656300.0
           MSFT    50.470001   50.619999   49.820000   50.320000   23842400.0
2016-05-20 AAPL    94.639999   95.430000   94.519997   95.220001   31804600.0
           GOOG   701.619995  714.580017  700.520020  709.739990    1816000.0
           MSFT    50.480000   51.220001   50.400002   50.619999   23692400.0
2016-05-23 AAPL    95.870003   97.190002   95.669998   96.430000   37860500.0
           GOOG   706.530029  711.478027  704.179993  704.239990    1320900.0
           MSFT    50.599998   50.680000   49.980000   50.029999   25999700.0
2016-05-24 AAPL    97.220001   98.089996   96.839996   97.900002   35036800.0
           GOOG   706.859985  720.969971  706.859985  720.090027    1920400.0
           MSFT    50.700001   51.709999   50.400002   51.590000   34621600.0
2016-05-25 AAPL    98.669998   99.739998   98.110001   99.620003   38168800.0
           GOOG   720.760010  727.510010  719.705017  725.270020    1629200.0
           MSFT    51.919998   52.490002   51.790001   52.119999   24040200.0
2016-05-26 AAPL    99.680000  100.730003   98.639999  100.410004   56093400.0
           GOOG   722.869995  728.330017  720.280029  724.119995    1542900.0
           MSFT    51.930000   51.980000   51.360001   51.889999   24182900.0
2016-05-27 AAPL    99.440002  100.470001   99.250000  100.349998   36229500.0
           GOOG   724.010010  733.935974  724.000000  732.659973    1974000.0
           MSFT    51.919998   52.320000   51.770000   52.320000   17653700.0

                   Adj Close
Date       minor
2012-05-30 AAPL    76.159610
           DELL    12.149920
           GOOG   293.821674
           MSFT    26.215653
2012-05-31 AAPL    75.970256
           DELL    11.927430
           GOOG   290.140354
           MSFT    26.081627
2012-06-01 AAPL    73.768977
           DELL    11.675920
           GOOG   285.205295
           MSFT    25.420428
2012-06-04 AAPL    74.202920
           DELL    11.608210
           GOOG   289.006480
           MSFT    25.509777
2012-06-05 AAPL    74.010939
           DELL    11.762980
           GOOG   284.920579
           MSFT    25.474038
2012-06-06 AAPL    75.145765
           DELL    11.816190
           GOOG   289.995487
           MSFT    26.224588
2012-06-07 AAPL    75.179952
           DELL    11.733960
           GOOG   288.826666
           MSFT    26.117366
2012-06-08 AAPL    76.310831
           DELL    11.724290
...                      ...
2016-05-16 AAPL    93.879997
           GOOG   716.489990
           MSFT    51.470002
2016-05-17 AAPL    93.489998
           GOOG   706.229980
           MSFT    50.509998
2016-05-18 AAPL    94.559998
           GOOG   706.630005
           MSFT    50.810001
2016-05-19 AAPL    94.199997
           GOOG   700.320007
           MSFT    50.320000
2016-05-20 AAPL    95.220001
           GOOG   709.739990
           MSFT    50.619999
2016-05-23 AAPL    96.430000
           GOOG   704.239990
           MSFT    50.029999
2016-05-24 AAPL    97.900002
           GOOG   720.090027
           MSFT    51.590000
2016-05-25 AAPL    99.620003
           GOOG   725.270020
           MSFT    52.119999
2016-05-26 AAPL   100.410004
           GOOG   724.119995
           MSFT    51.889999
2016-05-27 AAPL   100.349998
           GOOG   732.659973
           MSFT    52.320000

[3388 rows x 6 columns]

## 30.May 2016